msg_8 = 'Выбери любой из пунктов меню 👇'

msg_10 = 'РАБОТА В КОМАНДЕ\nСпособность совместно и эффективно работать с различными людьми в компании для достижения общих целей\nАкценты:\n- согласованность действий;\n- взаимопомощь;\n- этичность, уважение и вежливость;\n- осознанность своих эмоций\n- обсуждение спорных вопросов\n- открытая коммуникация'
msg_11 = 'Согласовывает свои действия / планы с другими участниками процесса'
msg_12 = 'Содействует коллегам в решении задач: интересуется их ситуацией, предлагает возможную с его стороны помощь'
msg_13 = 'Действует прозрачно, открыто и честно в соответствии с Кодексом Этики компании. Проявляет уважение, находит общий язык и взаимопонимание с людьми разного управленческого уровня, профессий, взглядов'
msg_14 = 'Понимает, как его чувства и эмоции могут влиять на работу, и управляет ими, чтобы минимизировать негативное воздействие. Сохраняет спокойствие в напряженных/стрессовых ситуациях'
msg_15 = 'Открыто обсуждает с коллегами возникающие  в работе разногласия, слушает и слышит других, дает возможность высказаться другим, задает уточняющие вопросы, резюмирует, ищет решение в интересах компании'
msg_16 = 'Проводит регулярные коммуникации, четко и понятно предоставляя необходимый объём информации для эффективной работы команды. Регулярно предоставляет и запрашивает обратную связь; использует ее для саморазвития и развития команды'

msg_17 = "ГОТОВНОСТЬ БРАТЬ ОТВЕТСТВЕННОСТЬ\nГотовность человека отвечать за то, что ему поручено или за то, что он взял на себя сам, умение принимать эффективные решения\n\nАкценты:\n- принятие ответственности за свои решения и действия;\n- выполнение обязательств;\n- способность самостоятельно принимать решения;\n- умение анализировать ошибки и учиться на них;\n- следование правилам"




msg_18 = 'Берет ответственность за свои и командные решения и действия, не перекладывает ее на других'

msg_19 = 'Выполняет взятые перед коллегами и партнерами обязательства, соблюдает установленные  договоренности, обеспечивает выполнение обязательств своей команды перед другими подразделениями компании'

msg_20 = 'Принимает сложные/ непопулярные решения в зоне своей ответственности, когда того требует ситуация, не ждет, пока другие будут давать инструкции к действию (сообщает о необходимости принимать сложные/непопулярные решения вне зоны своей ответственности на более высоком уровне)'

msg_21 = 'Признает, берет на себя ответственность за свои и командные ошибки, проактивно исправляет свои ошибки, делает выводы для предотвращения их в будущем'

msg_22 = 'Понимает важность системного подхода и участвует в разработке правил, политик, процессов компании, тщательно их соблюдает и призывает к этому команду'

msg_23 = "БИЗНЕС-ОРИЕНТИРОВАННОСТЬ\nВысокий уровень отдачи работе, находчивость, стремление вносить максимальный вклад в развитие и успех своей компании\nАкценты:\n- инициативность;\n- принятие изменений и умение работать в условиях неопределенности;\n- прикладывание дополнительных усилий;\n- поиск новых возможностей для бизнеса;\n- поддержка репутации компании;\n- готовность к вызовам"





msg_24 = 'Открыто обозначает проблемы/возможности как в своем подразделении, так и за его пределами; выдвигает инициативы по их решению, помогает проработать и реализовать полезные  инициативы'
msg_25 = 'Эффективно выполняет работу, несмотря на происходящие изменения, неоднозначность. Внедряет в свою работу проводимые в компании изменения, разъясняет и помогает команде подготовиться и внедрить изменения'

msg_26 = 'При необходимости, прикладывает дополнительные усилия в рамках своих функциональных обязанностей и вне их. Поощряет и ценит энтузиазм сотрудников, прикладывание дополнительных усилий при выполнении задач'

msg_27 = 'Находится в курсе отраслевой информации, ищет возможности для улучшения существующих направлений бизнеса, исследует новые возможности для развития компании'

msg_28 = 'Поддерживает положительную репутацию компании'

msg_29 = 'Воспринимает сложные профессиональные вызовы как возможности для развития себя и своей команды'

msg_30 = "ПРОФЕССИОНАЛИЗМ\nСпособность эффективно, стабильно с высоким уровнем стандартов выполнять профессиональную деятельность, развивать новые способности и навыки\nАкценты:\n- уровень профессиональной экспертизы;\n- знание и отслеживание тенденций профессиональной сферы;\n- постоянное развитие через осознание своих сильных сторон и зон для развития;\n- критическое мышление;\n- широкий кругозор"




msg_31 = 'Владеет глубокими знаниями и навыками в своей профессиональной сфере. Ставит перед собой и командой профессиональные цели/задачи, способствующие развитию'

msg_32 = 'Следит за тенденциями в своей профессиональной области и предлагает изменения, актуализирует свои знания'

msg_33 = 'Знает свои сильные стороны и зоны для развития, активно использует в работе сильные стороны и предпринимает конкретные действия для своего развития, расширения кругозора, используя все доступные источники (обмен опытом, тренинги, конференции и т.д.)'

msg_34 = 'Быстро находит и комплексно анализирует информацию, делает выводы, критически их оценивает и предлагает альтернативные гипотезы'

msg_35 = 'Видит широкую картину, прогнозирует будущие сценарии и предлагает решения, которые показывают четкую логику и взаимосвязь между видением и действиями'

msg_36 = "ОРИЕНТАЦИЯ НА РЕЗУЛЬТАТ\nСпособность достигать результата и превышать его, несмотря на ограничения\nАкценты:\n- видение конечного результата;\n- планирование / прогнозирование;\n- стремление к амбициозным целям;\n- стойкость (упорство, настойчивость, стремление достигнуть цели);\n- умение концентрироваться на долгосрочных результатах работы;\n- управление ресурсами и рисками"




msg_37 = 'Понимает и транслирует команде видение конечного результата'

msg_38 = 'Эффективно планирует свою и командную работу в соответствии с бизнес-целями подразделения и стратегией компании'

msg_39 = 'Ставит амбициозные цели себе и мотивирует свою команду достигать выдающихся результатов'

msg_40 = 'Стойко преодолевает возникающие препятствия на пути к желаемому результату, помогает в этом другим коллегам/команде. Ищет альтернативные решения и добивается результата'

msg_41 = 'Проявляет терпение и умеет ждать долгосрочного результата своей работы, не теряя мотивации, помогает в этом команде'
msg_42 = 'Обеспечивает своевременный качественный результат работы команды за счет эффективного управления ресурсами и временем. Готов принять обдуманный риск и взять на себя ответственность за принятые меры'


msg_50 = 'Не соответсвует ожиданиям: не демонстрирует поведение'

msg_51 = 'Требуются улучшения: демонстрирует поведение, но необходимы улучшения'
msg_52 = 'Соответствует ожиданиям: регулярно демонстрирует поведение'
msg_53 = 'Превышает ожидания: Настоящая ролевая модель поведения'
msg_54 = 'Затрудняюсь ответить'
msg_60 = 'Пропустить'
msg_61 ="Комментарий к оценкам по компетенции Работа в команде"
msg_62 ="Комментарий к оценкам по компетенции Готовность брать ответственность"
msg_63 ="Комментарий к оценкам по компетенции БИЗНЕС-ОРИЕНТИРОВАННОСТЬ"
msg_64 ="Комментарий к оценкам по компетенции Профессионализм"
msg_65 ="Комментарий к оценкам по компетенции Ориентация на результат"
msg_70 = 'Кого ты хотел бы оценить?\nВыбери из меню👇'
msg_71 = 'У вас не осталось коллег, которых ещё нужно оценить'
msg_72=  'У вас не осталось руководителей, которых ещё нужно оценить'
msg_73 = 'У вас не осталось подчинённых, которых ещё нужно оценить'
msg_80 = 'Отчёт по всем сотрудникам'
msg_81 = 'Отчет по одному сотруднику'
msg_90 = '↩️Назад'
msg_91 = 'Спасибо за оценку!'
msg_92 = 'Нет сотрудников с готовыми отчётами'
msg_93 = 'выбери чей отчёт получить'
msg_94 = 'Посмотреть отчёт в текущем состоянии'
msg_95 = 'Посмотреть отчеты подчинённых'
msg_96 = 'У вас нет подчинённых'
msg_97 = 'Выберите сотрдника'


##Специалист
msg_110 = 'РАБОТА В КОМАНДЕ\nСпособность совместно и эффективно работать с различными людьми в компании для достижения общих целей\nАкценты:\n- согласованность действий;\n- взаимопомощь;\n- этичность, уважение и вежливость;\n- осознанность своих эмоций\n- обсуждение спорных вопросов\n- открытая коммуникация'
msg_111 = 'Согласовывает свои действия / планы с другими участниками процесса'
msg_112 = 'Содействует коллегам в решении задач: интересуется их ситуацией, предлагает возможную с его стороны помощь'
msg_113 = 'Действует прозрачно, открыто и честно в соответствии с Кодексом Этики компании. Уважительно общается с коллегами разных уровней и подразделений'
msg_114 = 'Понимает, как его чувства и эмоции могут влиять на работу, и управляет ими, чтобы минимизировать негативное воздействие. Сохраняет спокойствие в напряженных/стрессовых ситуациях'
msg_115 = 'Конструктивно обсуждает спорные вопросы: выслушивает мнение других, аргументирует свою позицию,  ищет компромиссное решение'
msg_116 = 'Четко и понятно излагает свои мысли, доносит основную информацию. Открыт/а к предоставлению и получению обратной связи: в случае конструктивной критики, стремится исправить ошибки'

msg_117 = "ГОТОВНОСТЬ БРАТЬ ОТВЕТСТВЕННОСТЬ\nГотовность человека отвечать за то, что ему поручено или за то, что он взял на себя сам, умение принимать эффективные решения\n\n\nАкценты:\n- принятие ответственности за свои решения и действия;\n- выполнение обязательств;\n- способность самостоятельно принимать решения;\n- умение анализировать ошибки и учиться на них;\n- следование правилам"
msg_118 = 'Берет ответственность за собственные действия и качество работы'
msg_119 = 'Выполняет взятые перед коллегами и партнерами обязательства, соблюдает  установленные договоренности'
msg_120 = 'Уверен в своих силах и принимает решения в зоне своей ответственности без дополнительного контроля руководителя'
msg_121 = 'Признает, берет на себя ответственность, проактивно исправляет ошибки, делает выводы для предотвращения их в будущем'
msg_122 = 'Понимает важность поддержания всех внутренних правил и процедур компании, точно и тщательно их соблюдает'

msg_123 = "БИЗНЕС-ОРИЕНТИРОВАННОСТЬ\nВысокий уровень отдачи работе, находчивость, стремление вносить максимальный вклад в развитие и успех своей компании\n\nАкценты:\n- инициативность;\n- принятие изменений и умение работать в условиях неопределенности;\n- прикладывание дополнительных усилий;\n- поиск новых возможностей для бизнеса;\n- поддержка репутации компании;\n- готовность к вызовам"
msg_124 = 'Проявляет инициативу: делится идеями, проактивно обсуждает и реализовывает новые идеи'
msg_125 = 'Внедряет в свою работу проводимые в компании изменения. Ищет решения, когда сталкивается с неопределенностью или неизвестностью'
msg_126 = 'При необходимости, прикладывает дополнительные усилия в рамках своих функциональных обязанностей и вне их'
msg_127 = 'Находится в курсе отраслевой информации'
msg_128 = 'Поддерживает положительную репутацию компании'
msg_129 = 'Проявляет готовность и желание решать новые, непривычные для себя задачи/вызовы'

msg_130 = 'ПРОФЕССИОНАЛИЗМ\nСпособность эффективно, стабильно с высоким уровнем стандартов выполнять профессиональную деятельность, развивать новые способности и навыки\n\nАкценты:- уровень профессиональной экспертизы;\n- знание и отслеживание тенденций профессиональной сферы;\n- постоянное развитие через осознание своих сильных сторон и зон для развития;\n- критическое мышление;\n- широкий кругозор'
msg_131 = 'Владеет необходимыми навыками и знаниями в своей профессиональной области. Ищет возможности и задачи, развивающие профессиональные знания/умения'
msg_132 = 'Следит за тенденциями в своей профессиональной области, актуализирует свои знания'
msg_133 = 'Оценивает и знает свои сильные стороны и зоны для развития, какие навыки и знания ему необходимо развивать для более эффективного выполнения работы (сам или спрашивает у руководителя). Самостоятельно осваивает требующиеся знания и навыки доступными ему способами'
msg_134 = 'Проводит глубокий анализ информации в рамках своей сферы деятельности, критически мыслит, определяет причинно-следственные связи'
msg_135 = 'Во время выполнения отдельных задач видит целостную картину и значимость выполненной работы для бизнес-целей'

msg_136 = "ОРИЕНТАЦИЯ НА РЕЗУЛЬТАТ\nСпособность достигать результата и превышать его, несмотря на ограничения\n\n\nАкценты:\n- видение конечного результата;\n- планирование / прогнозирование;\n- стремление к амбициозным целям;\n- стойкость (упорство, настойчивость, стремление достигнуть цели);\n- умение концентрироваться на долгосрочных результатах работы;\n- управление ресурсами и рисками"
msg_137 = 'Понимает и уточняет/проясняет видение конечного результата'
msg_138 = 'Эффективно планирует свою работу, основываясь на расставленных руководителем приоритетах'
msg_139 = 'Нацелен на достижения, с готовностью берется за амбициозные задачи'
msg_140 = 'Доводит дело до результата, не отступает, сталкиваясь с препятствиями'
msg_141 = 'Проявляет терпение и умеет ждать долгосрочного результата своей работы'
msg_142 = 'Качественно выполняет задачи в срок, при этом эффективно распределяет ресурсы и управляет своим временем. Учитывает соотношение затрат, результатов и рисков'



##Топ-Менеджер
msg_210 = 'РАБОТА В КОМАНДЕ\nСпособность совместно и эффективно работать с различными людьми в компании для достижения общих целей\nАкценты:\n- согласованность действий;\n- взаимопомощь;\n- этичность, уважение и вежливость;\n- осознанность своих эмоций\n- обсуждение спорных вопросов\n- открытая коммуникация'
msg_211 = 'Способствует и реализует согласованность действий сотрудников своей и других функций/подразделений (инициирует обсуждения проблем и задач, содействует обмену информацией и пр.), учитывает интересы всей компании, а не только своей функции/подразделения'
msg_212 = 'Участвует в формировании и поддерживает культуру взаимопомощи и командной работы в компании'
msg_213 = 'Формирует и поддерживает культуру бизнес-поведения на основе принципов Кодекса Этики, является ролевой моделью с точки зрения Кодекса Этики, вежливого и уважительного обращения с другими'
msg_214 = 'Управляет своими эмоциями и влияет на эмоции других в различных ситуациях, особенно в сложных/стрессовых'
msg_215 = 'Способствует открытому обсуждению ключевых для бизнеса спорных, сложных, неудобных вопросов, нацеливает коллег и сотрудников на поиск конструктивного решения в интересах компании'
msg_216 = 'Коммуницирует четко и понятно, адаптирует стиль общения под различные аудитории. Регулярно предоставляет и запрашивает обратную связь, открыт к ее получению; поддерживает культуру обратной связи для саморазвития и развития команды'

msg_217 = "ГОТОВНОСТЬ БРАТЬ ОТВЕТСТВЕННОСТЬ\nГотовность человека отвечать за то, что ему поручено или за то, что он взял на себя сам, умение принимать эффективные решения\n\n\nАкценты:\n- принятие ответственности за свои решения и действия;\n- выполнение обязательств;\n- способность самостоятельно принимать решения;\n- умение анализировать ошибки и учиться на них;\n- следование правилам"
msg_218 = 'Берет ответственность за свои и командные решения, за бизнес и результаты деятельности актива, понимая, как это влияет на результаты бизнеса в целом'
msg_219 = 'Выполняет взятые перед коллегами и партнерами обязательства, соблюдает установленные  договоренности, обеспечивает выполнение обязательств своего подразделения перед другими подразделениями компании'
msg_220 = 'Самостоятельно принимает решения в рамках своей зоны ответственности о развитии подразделения, сложные/непопулярные решения, при этом инициирует, вовлекает команду в обсуждение (сообщает о необходимости принимать сложные/непопулярные решения вне зоны своей ответственности на более высоком уровне)'
msg_221 = 'Признает собственные ошибки и ошибки команды, "не ищет виновного", а проактивно исправляет,  делает выводы для предотвращения их в будущем'
msg_222 = 'Поддерживает систВыполняется получение данных. Подождите несколько секунд, а затем еще раз попробуйте вырезать или скопироватемы, процессы и политики, которые обеспечивают долговременный результат. Соблюдает и контролирует соблюдение другими правил и процедур компании'

msg_223 = "БИЗНЕС-ОРИЕНТИРОВАННОСТЬ\nВысокий уровень отдачи работе, находчивость, стремление вносить максимальный вклад в развитие и успех своей компании\n\nАкценты:\n- инициативность;\n- принятие изменений и умение работать в условиях неопределенности;\n- прикладывание дополнительных усилий;\n- поиск новых возможностей для бизнеса;\n- поддержка репутации компании;\n- готовность к вызовам"
msg_224 = 'Поощряет проявление инициативы сотрудниками, способствует реализации полезных инициатив внутри подразделения и за его пределами. Открыто обозначает проблемы/возможности как в своем подразделении, так и за его пределами, выдвигает инициативы по их решению'
msg_225 = 'Эффективно справляется с переменами; может действовать в условиях недостатка информации и неопределенности; инициирует, разъясняет и помогает сотрудникам подготовиться и внедрить изменения, справиться с неопределенностью'
msg_226 = 'При необходимости, прикладывает дополнительные усилия в рамках своих функциональных обязанностей и вне их. Поощряет и ценит энтузиазм сотрудников, прикладывание дополнительных усилий при выполнении задач'
msg_227 = 'Владеет отраслевой информацией и находится в курсе рыночных трендов, активно ищет и исследует новые возможности для развития своего актива/портфеля и компании в целом. Расширяет и поддерживает сеть контактов для поиска бизнес-возможностей'
msg_228 = 'Поддерживает положительную репутацию компании'
msg_229 = 'Формирует культуру восприятия вызовов как возможностей для развития себя, своей команды и компании'

msg_230 = 'ПРОФЕССИОНАЛИЗМ\nСпособность эффективно, стабильно с высоким уровнем стандартов выполнять профессиональную деятельность, развивать новые способности и навыки\n\nАкценты:- уровень профессиональной экспертизы;\n- знание и отслеживание тенденций профессиональной сферы;\n- постоянное развитие через осознание своих сильных сторон и зон для развития;\n- критическое мышление;\n- широкий кругозор'
msg_231 = 'Является авторитетом для сотрудников в профессиональной сфере. Ставит перед собой и командой профессиональные цели/задачи, способствующие развитию'
msg_232 = 'Отслеживает и анализирует тенденции в своей профессиональной области. Организует процесс поиска и внедрения в работу подразделения лучших практик, применимых для компании'
msg_233 = 'Знает свои сильные стороны и зоны для развития, является примером для команды в постоянном развитии своего профессионализма. Формирует сбалансированную команду (подбирает сильных членов команды с потенциалом, разным опытом и знаниями, развивает, мотивирует, помогает выстраивать карьеру)'
msg_234 = 'Формирует и оценивает гипотезы, критически их анализируя, принимает качественные решения'
msg_235 = 'Видит широкую картину, прогнозирует будущие сценарии и принимает решения с учетом всех факторов. Обладает широким кругом интересов'

msg_236 = "ОРИЕНТАЦИЯ НА РЕЗУЛЬТАТ\nСпособность достигать результата и превышать его, несмотря на ограничения\n\n\nАкценты:\n- видение конечного результата;\n- планирование / прогнозирование;\n- стремление к амбициозным целям;\n- стойкость (упорство, настойчивость, стремление достигнуть цели);\n- умение концентрироваться на долгосрочных результатах работы;\n- управление ресурсами и рисками"
msg_237 = 'Формирует видение конечного результата и четко коммуницирует его команде'
msg_238 = 'Определяет цели подразделения в соответствии с бизнес-приоритетами компании в целом. Обеспечивает баланс долгосрочных целей и текущих задач в планах подразделения.'
msg_239 = 'Ставит амбициозные цели перед своим подразделением и вдохновляет сотрудников на достижение выдающихся  результатов'
msg_240 = 'Проявляет стойкость в достижении желаемого результата, не останавливается на полпути, ищет альтернативные решения и добивается результата. Умеет подбодрить и мобилизовать команду.'
msg_241 = 'Идет к намеченной цели необходимое количество времени, объясняет сотрудникам необходимость и причины ожиданий долгосрочного результата и подает пример выдержки и терпения'
msg_242 = 'Обеспечивает своевременный качественный результат работы функции за счет эффективного управления ресурсами и временем в кратко- и долгосрочном периоде. Принимает взвешенные риски для достижения целей компании/функции'



#сделать функцию которая вернут массив с сообщениями для хендлеров

#у человека должна создаваться таблица в зависимости от дожности










